[
  {
    "id":"1",
    "type": "Circuit",
    "name": "Suntrakanesh SU",
    "year": 2023,
    "department": "EIE",
    "information": "The Incorrigible Optimist makes it big!!\n\n\"Have GCTians ever won a Nobel?\" might sound incredibly naive to us. But when the questioner is Suntrakanesh SU (EIE 2023), it reflects a deep sense of optimism that has shaped his life. \n\nBorn in a financially challenged family, nourished by the Tamiraparani river waters and blessed by Nellaiappar and his consort Kanthimathi, Suntar is one guy for whom the word 'impossible' never exists in the dictionary. \n\nHe could have happily 'settled' after he managed to grab and complete a paid internship at Bargava Subramanian 's firm. \n\nBut he was seeking something almost 'impossible' - An internship in the semiconductor domain. \n\nAs luck would have it, his resume landed at the desk of a key decision-maker at Boise, Idaho. He happened to work for Micron Tech., a global leader in memory devices.\n\nThe rest, as they say, is history. \n\nSuntar gets to be probably the first GCT student to join Micron Tech, as a Layout Design Intern. \n\nThis group wishes him the very best and hopes that he continues to remain blessed.\n\nImage: The one being photographed is our man!",
    "images": "https://firebasestorage.googleapis.com/v0/b/startup-st.appspot.com/o/Suntrakanesh.jpg?alt=media&token=41b395ab-98da-4e0c-914d-0ea24bf5d948",
    "tags": ["DataScience", "FullStack", "Layout Design"]
  },
  {

    "id":"2",
    "type": "Non-Circuit",
    "name": "Pavithra Lakshmikanthabharathi",
    "year": 2023,
    "department": "CIVIL",
    "information": "The Swayamvaram..\n\n15 calls! Yes, 15 in 5 days. \n\nSome founders were desperate! \n\nOne even asked for feedback on the interview process. \n\nFor Pavithra Lakshmikanthabharathi (Civil 2023), this was a week that may change her life. She was overwhelmed and exhausted talking to so many founders.\n\nShe even had to reject an offer from a firm that is into Metaverse (Of course, the Founder asked her to stay in touch.)\n\nAnd finally it had to be Orangewood Labs (They are into building Robots), a Y Combinator firm from the 2018 cohort. \n \nPavi shall work remotely from GCT as a paid intern. \n\nShe shall spend some time as an Executive Assistant to the Co-Founder before taking up a Product Management Role, a role many IIM Grads covet.\n\nPavi. Congrats!! This is big. Very big. A Y Combinator Firm on your resume shall put your career on a completely different orbit. \n\nGood luck. And God Bless.",
    "images": "https://firebasestorage.googleapis.com/v0/b/startup-st.appspot.com/o/Pavithra%20Lakshmi.jpg?alt=media&token=a1fcad4e-7285-4596-8be8-7701908de3c1",
    "tags": ["Digital Marketing", "FullStack", "Product-Managment"]
  },
  {
    "id":"3",
    "type": "Circuit",
    "name": "Akshaya Raj",
    "year": 2023,
    "department": "CSE",
    "information": "Playing the skill game on the front foot. \n\nIt is very well known that most firms that visit campus seek generic skills, that disincentivizes the need to specialize. \n\nOur initiative to connect profiles to startups is slowly changing the rules of the game. \n\nIt is driving the point that specialization, sells. \n\nAkshaya Raj's (2023) profile is a classic example. Here is a profile with a singular focus on Analytics + Visualization and Story Telling. \n\nNeedless to say, startups liked it. \n\nShe got offers from Frankfurt-based, Travit GmbH (Industrial AI), Energos (Working on Smart Grids) and Omnify (A SaaS platform for small services business).\n\nShe rejected these to join Flutura Decision Sciences & Analytics (An AI Solutions firm) as an intern. \n\nShe shall be spending the next few months working on a Deep Learning Problem. \n\nWe wish Akshaya the very best and hope that many more follow her path.",
    "images": "https://firebasestorage.googleapis.com/v0/b/startup-st.appspot.com/o/Akshaya%20raj.jpg?alt=media&token=0fc8c3aa-4557-4c40-bdcb-8cf11ba5222c",
    "tags": ["DataAnalytics"]
  },
  {
    "id":"4",
    "type": "Circuit",
    "name": "Naveenprabaharan Selvaraj",
    "year": "2021",
    "department": "IT",
    "information": "Payback Time..\n\nIt was June 2021, Naveen K (2021) had ditched a job at an aspirational firm, as the role was not something he was looking forward to. \n\nHe had a burning desire to be a Data Scientist. Without a job in sight, Naveen reached out to Bargava Subramanian (2002). It was a good profile and Bargav was happy to send it to Animall, a firm to which he was a Data Science Advisor. \n\nEverything went smooth, until an IIT KGP profile suddenly popped up at Animall. It was a very poor profile, Naveen's was 3x better. But it was an IIT BTech. profile. \n\nIt took some nudge from Bargav to get Naveen past the finish line. \n\nThe last 8 months has been spectacular for Naveen with eye-popping raises in Cash and Stock Awards. \n\nBut the time had come to give back. \n\nNaveenprabaharan Selvaraj (2023) is a Mech. Diploma holder who had worked as a Design Engineer for 2 years. This was before a burning desire to be a Data Scientist, landed him at GCT. \n\nMentored by Bangolae Lakshmikanth Balaji (CEO Renkube) and Naveen K, Jr. Naveen was waiting for the right opportunity. \n\nIt did come when Animall gave Sr. Naveen the freedom to hire a Data Science Intern. \n\nNo prizes for guessing - The mentor hired the mentee.\n\nThis community thanks the mentors for making this happen and wishes Jr. Naveen, the very best. \n\nMay our mafia rule!!",
    "images": "",
    "tags": ["DataScience"]
  },
  {
    "id":"5",
    "type": "Non-Circuit",
    "name": "Akshaya Arunkumar",
    "year": 2023,
    "department": "PROD",
    "information": "Mafia Strikes. Again! \n\n76 potential applications from all over India to choose from. But Shanavas Shareif K (Prod 2020) ignored all of them to find talent in GCT Campus. \n\nHe zeroed in on Akshaya Arunkumar (Prod 2023), mentored by Brindha Dhanabalan, CFA (ECE 2002) and Shanavas himself.\n\nAkshaya is probably the one great talent on campus - smart, communicative and humane - who never wanted to code. \n\nA key member of the gSARC team (GCT Student Alumni Relationship Cell), Akshaya has been hired as a Digital Marketing Intern by Epitome at a cool Rs.15,000 p.m. as stipend. \n\nBased on performance, Epitome may choose to hire her in a full-time role later.  \n\nAkshaya has another year to go before she graduates. \n\nIt's a new beginning for her, an unchartered territory for most Engineers. But knowing Akshaya, we know she will ace it, for she is the rockstar from the batch of 2023.\n\nGood Luck. And God Bless..",
    "images": "https://firebasestorage.googleapis.com/v0/b/startup-st.appspot.com/o/Akshaya%20Arunkumar.jpg?alt=media&token=e0df3777-1e02-4ad2-8e9f-348f472f13d7",
    "tags": ["Digital Marketing"]
  },
  {
    "id":"6",
    "type": "Circuit",
    "name": "Ganapriya",
    "year": 2023,
    "department": "CSE",
    "information": "The Power of a Portfolio, and a Reco.\n\n\"Ganapriya is a 10x Engineer and one of the finest interns I have ever worked with\", so went the message from Bargava Subramanian's phone to the Industrial AI Community. \n\nAfter a few hours lull, the Swayamvaram began. A dozen suitors lined up. \n\nAnd today Ganapriya Kheersagar (2023) chose to accept an internship offer from AIRPIX, a Drone Solutions Provider. \n\nShe shall join them as an \"AI and ML Developer\". \n\nHer internship shall involve solving some interesting AI related problems around Drone Tech. \n\nGood luck. And God Bless.",
    "images": "https://firebasestorage.googleapis.com/v0/b/startup-st.appspot.com/o/Ganapriya%20Gheersagar.jpg?alt=media&token=eb79a4d2-24f1-42fd-b462-c01e78eaada7",
    "tags": ["AI and ML Developer", "FullStack","DataEngineer"]
  },
  {
    "id":"7",
    "type": "Circuit",
    "name": "Rambarath Prabu",
    "year": 2023,
    "department": "EIE",
    "information": "Much to learn from Ram..\n\nThe last 2/3 years had been a difficult time for Rambarath Prabu (EIE 2023). His family income had plummeted to zero and he had to rely on the generosity of others as well as Alumni Scholarships to survive. \n\nDespite having a good CGPA, he felt that he needed to pick relevant skills to make him market ready. \n\nPoverty meant that he didn't have access to a computer. \n\nProvidence struck in Jan 2022, when he managed to lay his hands on a second hand laptop that was offered free of cost. \n\nHe spent the last 6 weeks learning Advanced MS Excel and Power BI to position himself as an Analytics Professional. \n\nToday he is elated. He has been offered a remote paid internship by Bangalore based HappSales, an AI-powered account management CRM app. \n\nRam has been placed as an Analytics Intern and has been offered Rs 8,000 p.m. as stipend, a mighty sum given his financial situation. \n\nGood luck Ram. And God Bless.",
    "images": "",
    "tags": ["DataAnalytics"]
  },
  {
    "id":"8",
    "type": "Circuit",
    "name": "Mohamed Asif",
    "year": 2022,
    "department": "ECE",
    "information": "Long-Term Skill Game. \n\nThe pandemic was a devastating time for Mohamed Asif (2022). He had lost his father and his family income had plummeted to zilch. \n\nHe managed to pay the final year fee thanks to the generosity of a VIT/XLRI Alumnus (And a GCT well-wisher).\n\nWhile campus placements did offer him a role at a large IT services firm, he wasn't too sure about the skills he would pick. \n\nThat's when Shanmuga KS (Shan) (2003) , Founder and CEO Tachyon, made an exclusive offer to hire GCTians. An assignment and an interview later, Asif got an offer from Tachyon. Asif shall be based out of Manapparai. \n\nAt Tachyon, Asif has the option of choosing from a bouquet of skills, each of them being market relevant. \n\nWhen we asked Asif about the reasons behind his decision to choose Tachyon over a large IT services firm, he said something insightful,\n\n\"I am playing the long-term skill game.\"\n\nCongrats. And God Bless.",
    "images": "",
    "tags": ["FullStack"]
  },
  {
    "id":"9",
    "type": "Circuit",
    "name": "Mohammed Mushamil",
    "year": 2021,
    "department": "ECE",
    "information": "Employed with a leading IT services firm, life at Palayamkottai was going quite good for Mohammed Mushamil (ECE 2021). \n\nBut deep within he knew that he was not picking skills that matter in the job market. \n\nA suggestion by Mohamed Asif (ECE 2022) led Mushamil to us. \n\nWhile for Mushamil, skills mattered and not compensation, given his profile, we took the risk of positioning him at a compensation that would place him within the Top 2/3 % of the GCT Cohort of 2021. \n\nThe gamble worked! \n\nToday, Mushamil got an offer from Flutura (IIoT Firm) for a Fullstack Developer position. \n\nMushamil is surprised at the lucky turn of events. But the fact is, he made the right moves at the right time. \n\nGood Luck. And God Bless.",
    "images": "",
    "tags": ["FullStack"]
  },
  {
    "id":"10",
    "type": "Non-Circuit",
    "name": "Valli Nayagam",
    "year": 2021,
    "department": "PROD",
    "information": "It was a daily chore, a 3 hour excruciating bus travel from Tiruchendur to Tirunelveli, one that would consume 30% of his monthly earnings. \n\nBut Valli Nayagam (Prod 2021) was not deterred. He was seeking a bigger canvas to prove himself. \n\nProvidence struck. \n\nGurunathan Subramanyan (IT 2008) helped us connect with Prithi B (IT 2008), who had recently rebooted her career as a Blockchain Architect at Vincilium, after a career break. \n\nWe helped Prithi connect with Valli. \n\nIt wasn't easy for Valli, for he had to manage his work, travel, and an assessment process that took more than a month. \n\nToday, he got a Fullstack Developer offer from Vincilium, a young startup that operates in the Distributed Ledger Tech space. \n\nVincilium's CEO Rohit Sehgal is excited to meet Valli and Valli is truly elated. \n\nA special thanks to Thiliban Ravichandran (Prod 2022) and Ganapriya Kheersagar (CS 2023) for providing support to Valli when he was stuck. \n\nValli - The entire GCT community was behind your success. Your journey has just begun. \n\nGood Luck. And God Bless.",
    "images": "",
    "tags": ["FullStack"]
  },
  {
    "id":"11",
    "type": "Circuit",
    "name": "DhodRaj",
    "year": 2022,
    "department": "EIE",
    "information": "Change is in the offing...\n\nDhodRaj S (EIE 2022) did something very unusual today. \n\nHe ditched a campus offer and chose to join Glint, a 2 year old startup that is India's first subscription-based hyperlocal service fullfilling daily car care. \n\nHe managed to land at this opportunity out of his own efforts, through AngelList  - probably a first for his batch. \n\nDhod who joins Glint as a fullstack developer shall help Glint with its customer facing application, goglint. \n\nCongrats Dhod. \n\nWe are sure that you shall have a fantastic time and pick great skills.\n\nGood Luck.",
    "images": "",
    "tags": [ "FullStack"]
  },
  {
    "id":"12",
    "type": "Non-Circuit",
    "name": "Raja G",
    "year": 2020,
    "department": "MECH",
    "information": "From hopelessness to optimism. \n\nBack in 2020, to Raja G - a Mechanical Engineer from a poor family - life seemed to be a dull, dreary march to the grave. \n\nIt was the worst time to graduate. Manufacturing was in the dumps. If the pandemic didn't take your life, penury and shame would.\n\nRaja started his career on daily wages as a painter. But he certainly knew that life was going nowhere. \n\nCut to Aug 2021. \n\nOn the advice of Ajai Kannan (Mech 2020), Raja chose to steer where the wind was blowing and decided to self-learn fullstack web development. \n\nFor someone who barely coded while on campus, the journey wasn't easy. \n\nBut Feb 1st 2022 would be a day permanently etched in his memory. He got his first paycheck for a skill (Blockchain + Flutter) the world is set to pay a premium in the years to come. \n\nSpecial thanks to Satheesh Ananthasubramanian (CEO, Rage.Fan) for giving Raja, a chance (It was a 'Come to my office and join' kind of offer).\n\nAnd many thanks to Panneer Selvam (Mech 2020, employed with Rage.Fan) for being a good friend and opening up the doors of Rage.Fan to Raja. \n\nGood Luck. And God Bless.",
    "images": "",
    "tags": [ "FullStack"]
  },
  {
    "id":"13",
    "type": "Circuit",
    "name": "Annamalai",
    "year": 2022,
    "department": "EIE",
    "information": "I don't think anyone from my batch would have left a full-time offer from abc firm (An aspirational firm on campus), for an uncertain 6 month internship\", said a batch of 2020 alum on Annamalai V R 's decision. \n\nAnnamalai is an EIE student from the Batch of 2022, was the first from his class to be placed, and that too with an aspirational employer. \n\nBut he always wanted to be in the Analytics domain. \n\nSo when an opportunity came his way, he took it. \n\nHis senior, Varshini U J (2021) had put up such a good show at SG Analytics as a Data Scientist that its Analytics SVP, Dr. Chiranjeev Roy reached out to Bargav (2002), seeking another profile from GCT, from the Batch of 2022.\n\nBargava Subramanian also offered a Data Scientist role to Annamalai at Pinhead Analytics (A firm in which Bargav holds a stake).\n\nAnnamalai chose to join SG Analytics as an intern working in the 'Image Processing Analytics' Domain. \n\nThis community wishes Annamalai the very best and hopes that he shall make us proud just as Varshini U J did.",
    "images": "",
    "tags": ["DataScience"]
  },
  {
    "id":"14",
    "type": "Non-Circuit",
    "name": "Arun Kumar",
    "year": 2017,
    "department": "PROD",
    "information": "Arun Kumar is a special alumnus. \n\nFor he is an alum of GCT, in spirit, but not on paper. \n\nArun joined GCT in 2017 (Production) and had to drop out of the program to take care of the financial needs of his family. \n\nHe did odd jobs to make the ends meet. \n\nWhile life was seemingly going nowhere, Arun had the sagacity to listen to the wise counsel of Vignesh S (2017-21), and picked up skills (Business Intelligence - BI) that would make him competitive in the job market. \n\nToday, his efforts bore fruit. \n\nBargava Subramanian's firm (2002) has offered Arun, a BI Intern Position, with a clear 3 month roadmap to a full-time position at a market competitive compensation, one that shall place him comfortably within the Top 10 percentile of his GCT Cohort. \n\nThere is something refreshing about Bargav's approach towards hiring. \n\nIn Bargav's words \"I don't care about his degree. He has the skills and the projects.\"\n\nWe wish Arun the very best. \n\nAnd a special thanks to Vignesh S for being a good friend. \n\nP.S. Arun is a part-time BSc. Physics student at Bharathiyar University. He is expecting to graduate soon.",
    "images": "",
    "tags": ["Business Intelligence"]
  },
  {
    "id":"15",
    "type": "Circuit",
    "name": "Jeremy Asirwaad",
    "year": 2022,
    "department": "IT",
    "information": "Congrats Guys...\n\nIn an interesting and surprising move, Dubai-based Aaronz and Co. Real Estate offered paid internships to 2nd year students Jeremy Asirwaad and Raghav Jindal (Both from the Batch of 2024)  \n\nThey join Aaronz on Dec 17th as Engineering Interns and shall be working remotely. \n\nYesterday evening, the CEO of MMJS Consulting (The parent company of Aaronz) called Jeremy and Raghav from Dubai (One of them got a call at 11 PM IST!) and after a brief chat rolled out the offers today. \n\nThe guys are excited at the prospect of picking up great skills and earning their first paycheck. \n\nThis community wishes the chaps good luck.",
    "images": "https://firebasestorage.googleapis.com/v0/b/startup-st.appspot.com/o/Jeremy%20Ashirwad%20%20and%20Ragav%20Jindal%20(1).jpg?alt=media&token=a4061dfb-5923-4717-aef1-79bb2536c909",
    "tags": [ "FullStack"]
  },
  {
    "id":"16",
    "type": "Circuit",
    "name": "Raghav Jindal",
    "year": 2022,
    "department": "IT",
    "information": "Congrats Guys...\n\nIn an interesting and surprising move, Dubai-based Aaronz and Co. Real Estate offered paid internships to 2nd year students Jeremy Asirwaad and Raghav Jindal (Both from the Batch of 2024)  \n\nThey join Aaronz on Dec 17th as Engineering Interns and shall be working remotely. \n\nYesterday evening, the CEO of MMJS Consulting (The parent company of Aaronz) called Jeremy and Raghav from Dubai (One of them got a call at 11 PM IST!) and after a brief chat rolled out the offers today. \n\nThe guys are excited at the prospect of picking up great skills and earning their first paycheck. \n\nThis community wishes the chaps good luck.",
    "images": "https://firebasestorage.googleapis.com/v0/b/startup-st.appspot.com/o/Jeremy%20Ashirwad%20%20and%20Ragav%20Jindal%20(1).jpg?alt=media&token=a4061dfb-5923-4717-aef1-79bb2536c909",
    "tags": ["FullStack"]
  },
  {
    "id":"17",
    "type": "Non-Circuit",
    "name": "Akash Pavan",
    "year": 2020,
    "department": "MECH",
    "information": "The Rockstar from the Batch of 2020 makes his move. \n\nCaptain of Team Screwtenizers, Great Acads, Patent Filing and many more - It's for a reason that Akash Pavan (Mech 2020), was considered the star of his batch. \n\nAfter a year and a half at Titan Engineering, Akash was seeking a bigger canvas in a small shop. \n\nThat's when Ajai Kannan ( Mech 2020) who works for Bargava Subramanian (Mech 2002), suggested that Akash interview with Axion Ray, a firm that is looking to disrupt the R&D Engineering process in Automotive and Aerospace industries. \n\nBargav introduced Akash to Daniel, an alumnus of McKinsey, CEO of Axion Ray, who was later floored by Akash. \n\nThe rest, as the cliche goes, is history. \n\nWhen we asked Akash about why he would want to switch from core engineering, this is what he had to say\n\n\"We'll see a lot of Manufacturing/Mechanical Industries hiring less and less, depending more on Software tools in coming years. A single Mech engineer will be able to build stuff many times faster. My current switch will look obvious to anyone in the Mech industry in a few years.\"\n\nNow that was perceptive. \n\nIt's for a reason, we call Akash, 'The Rockstar of 2020'. \n\nGood Luck and God Bless..",
    "images": "",
    "tags": ["DataScience", "FullStack"]
  },
  {
    "id":"18",
    "type": "Non-Circuit",
    "name": "Panneer Selvam",
    "year": 2020,
    "department": "MECH",
    "information": "From Brick and Mortar to Digital. \n\nPanneer Selvam is your typical Mechanical Engineering graduate (Batch of 2020), but with a twist. \n\nWith Engineering hiring in manufacturing going through a deep slump, Panneer started his career as a Construction Supervisor in a small firm his friend ran. \n\nBut he realized that taking such a career path shall not do justice to his talent. \n\nHe chose to embrace the digital economy, picked up fullstack web development,  some AI and Digital Marketing skills. \n\nHe approached us to help him get that one break, which we all know can be a stepping stone to a great career. \n\nThe break came in the form of Satheesh Ananthasubramanian (1995), who runs Rage.Fan, a fan-first sports platform with the vision to democratize sports using blockchain technology. \n\nPanner doesn't have an early lead compared to his peer group. And his compensation isn't one that shall invite his peer group's envy. \n\nBut a few years in NFT, Blockchain, can put his career on a different orbit. \n\nWe all have our career defining moments.\n\nIn Nov 2041, when Panneer, in a deeply reflective mood, looks back at his past, we are sure that he would emphatically consider the North East Monsoon (Vada Kizhakku Paruvamazhai) Season of 2021, as the one that ushered in the defining moment, one that changed everything for him. \n\nPanneer : \"Usura kuduthu velai paru. Vetri unnai thedi varum\". \n\nGood Luck. And God Bless.\n\nhttps://lnkd.in/giSzi22r",
    "images": "https://firebasestorage.googleapis.com/v0/b/startup-st.appspot.com/o/Paneer%20selvam.jpg?alt=media&token=8fe4b6be-5810-46a7-b567-e4a307a2ee0a",
    "tags": ["FullStack"]
  },
  {
    "id":"19",
    "type": "Non-Circuit",
    "name": "YOKESH K S",
    "year": 2021,
    "department": "M.E",
    "information": "Congrats YOKESH K S  (M.E. Engineering Design, Batch of 2021) on getting a fulltime role with Incresco. \n\nIncresco was Co-Founded by our alum, Santhosh Kumar Jayaraman, a Production Engineer from the Batch of 2009.\n\nYokesh is part of STEP UP, a project based, 'Learning by Doing' Program, run by GCT Alumni, to nurture fullstack developers for startups.\n\nThis community wishes Yokesh the very best.",
    "images": "",
    "tags": ["FullStack"]
  },
  {
    "id":"20",
    "type": "Circuit",
    "name": "Jayapriya",
    "year": 2023,
    "department": "IT",
    "information": "Congrats Jayapriya G (Batch of 2023) on cracking an internship with BIS Research (A market research firm). \n\nJayapriya is part of STEP UP, a project based, 'Learning by Doing' Program, run by GCT Alumni, to nurture fullstack developers for startups.\n\nWe are delighted that Jayapriya's internship shall fetch her a respectable compensation that is more than her family's regular income. \n\nIn what turned out to be an interesting sequence of events, we are also pleased to share that Jayapriya displayed strong negotiation skills in her dealing with BIS Research. \n\nHere is how the negotiations went:\n\nAct 1: First they asked her to sign up for a 4 month (non-paid) training followed by 15k p.m. internship. Jayapriya rejected it. \n\nAct 2: She called them up later and offered her services at 10k p.m. \n\nAct 3: They came back and offered her 10k p.m. but wanted her to work for 40 hours per week. Jaya rejected that as well.\n\nClimax: Today morning they called her and offered 10k p.m. at 25 hours a week. \n\nJaya finally accepted the offer. \n\nNow that's some negotiation by a 3rd year student!!\n\nThis community wishes Jayapriya good luck with her internship. \n\nWe are extremely confident that by the time she graduates, Jayapriya shall be drowned in offers!!\n\nGood Luck and God Bless.",
    "images": "",
    "tags": [ "FullStack"]
  },
  {
    "id":"21",
    "type": "Circuit",
    "name": "Varshini",
    "year": 2021,
    "department": "EIE",
    "information": "Varshini U J (2021 EIE) is special. \n\nIt was May 2021. Bargava Subramanian's initiative to connect GCT students with startups, launched with much enthusiasm, was floundering. \n\nLack of good profiles was derailing the nascent initiative. It badly needed its first victory. \n\nThat's when we got Varshini's profile. We were lucky to receive a profile that checked all boxes. \n\nBy May she received an offer from SG Analytics to work as an intern in the sensor analytics domain. \n\n4 months later, impressed with Varshini's work, SG Analytics has offered her a full-time role. \n\nShe joins them as a 'Junior Data Scientist'.\n\nThis community wishes her the best. We hope that the GCT flag flies high at SG and also hope that Varshini paves the  way for many more to join her.\n\nGood Luck and God Bless.\n\nErratum: The image has an incorrect designation. It should have been Scientist instead of Engineer.",
    "images": "https://firebasestorage.googleapis.com/v0/b/startup-st.appspot.com/o/Varshini%20U%20J.jpg?alt=media&token=021c5746-1190-471b-838e-b8edbeb3b0d4",
    "tags": ["DataScience", "FullStack"]
  },
  {
    "id":"22",
    "type": "Circuit",
    "name": "Shanavas",
    "year": 2023,
    "department": "IT",
    "information": "Our initiative to create space for our students and young alumni in the startup world is opening new vistas, a career in Digital Marketing being a case in point.\n\nShanavas Shareif K , a Production Engineer from the Batch of 2020, has managed to land in a full-time role at epitome.ai, a platform that uses ML and NLP to provide actionable insights into career progression. \n\nIn perhaps a first and keeping in mind the spirit of his role as a \"Full Stack Marketer\", his resume in a standard pdf format was not sent to the startup community. Instead his Portfolio was sent. \n\nThis is epitome.ai's second offer. Shanavas joins Kamalahassan (Batch of 2023) who is already interning with them as a full stack developer.\n\nThis community wishes Shanavas the very best. \n\nAnd many thanks to Bargava Subramanian for opening a window to these exciting opportunities in the startup world. \n\nhttps://lnkd.in/gyGH6Szq",
    "images": "",
    "tags": [ "FullStack"]
  },
  {
    "id":"23",
    "type": "Circuit",
    "name": "Logeshwaran",
    "year": 2021,
    "department": "EIE",
    "information": "Logeshwaran  (EIE Batch of 2021)- What a journey!!\n\nIn Nov 2020, Logesh was an EIE student dreaming of doing something in his domain. \n\nBut then he took a conscious decision to be a web developer. \n\n7 months later, his profile had underwent a complete transformation (From a pucca Electronics guy to a pucca Web Developer with 5 projects). \n\nHe didn't spend a penny during this transformation process. \n\nAnd today he managed to land an offer with Geekyants at a compensation that is at least 1.5 times more than the average compensation received on GCT Campus. \n\nhttps://www.roc8.careers/ played an important role in his journey. (Do read their manifesto. It is interesting)\n\nThey are a consultancy that places profiles based on 'Proof of Work' (Projects). They don't take a single penny from candidates. Once a candidate joins a firm, the firm pays roc8.\n\nThis community wishes Logesh the very best. \n\nHe has demonstrated that should the need arise, all it takes is 6/7 months of effort to transform a profile, and be successful. \n\nGood Luck Logeshwaran.",
    "images": "",
    "tags": ["FullStack"]
  },
  {
    "id":"24",
    "type": "Circuit",
    "name": "Vishal Pranav",
    "year": 2021,
    "department": "IT",
    "information": "Let's start our Monday on an auspicious note.\n\nVishal Pranav (Batch of 2023) after interviewing with a few startups got two offers for paid internships, one at MindNotix and the other at Inzite Global Data Science Ltd.\n\nHe has chosen to join Inzite Global as a paid intern today. After evaluation, he may be offered the position of Junior Data Engineer.\n\nCongrats Vishal. It shall not be easy. Give your best. Your success shall open the doors to many more from GCT.",
    "images": "",
    "tags": ["FullStack"]
  },
  {
    "id":"25",
    "type": "Circuit",
    "name": "Tamilarasu Vengatachalam",
    "year": 2023,
    "department": "IT",
    "information": "Congratulations Tamilarasu Vengatachalam (Batch of 2023) on getting an internship at HT Labs. \n\nHT Labs, a startup incubated by the Hindustan Times Group, develops digital- first products for audiences based on their preferences. \n\nThis is the result of a wider initiative to introduce our students to the world of startups.",
    "images": "",
    "tags": [ "FullStack"]
  },
  {
    "id":"26",
    "type": "Circuit",
    "name": "Yasholekha Rajasekhar",
    "year": 2023,
    "department": "EIE",
    "information": "It's Yasholekha Rajasekhar's (Batch of 2023) turn to crack the Krayen Internship. \n\nAfter much trepidation, the wait is finally over. Yash gets to intern with Krayen (A Bargava Subramanian venture) as a Marketing Analyst. She gets a stipend too. \n\nYash: Knowing Bargava Subramanian, you can expect one heck of a journey. But at the end it shall be fulfilling. Good luck. \n\nBargava Subramanian is still offering a few unpaid internships to our students, those who wish to go beyond their academics,and wish to get a feel for the startup ecosystem. For more details refer to Bargava's post in the group.",
    "images": "https://firebasestorage.googleapis.com/v0/b/startup-st.appspot.com/o/Yasolekha%20Rajasekhar.jpg?alt=media&token=7c887987-4e2a-415c-ab06-d11f51910b01",
    "tags": ["FullStack"]
  }
]